fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

//++ВКМ Салтанова 23.02.2026
// по правилам размещения
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//движение по заказам
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	//движение по остаткам товаров
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	//++ ВКМ Салтанова (Списание выполненных работ при проведении Акта)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;

	Для Каждого СтрУслуги Из Услуги Цикл
    	// Списываем только те работы, которые подтянулись из Обслуживания (не абонплату)
    	Если СтрУслуги.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить() Тогда
        	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьРасход();
        	Движение.Период = Дата;
        	Движение.Клиент = Контрагент;
        	Движение.Договор = Договор;
        	Движение.КоличествоЧасов = СтрУслуги.Количество;
        	Движение.СуммаКОплате = СтрУслуги.Сумма;
    	КонецЕсли;
	КонецЦикла;
	//-- ВКМ

КонецПроцедуры
//--ВКМ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ ВКМ 23.02.2026 Салтанова: Автозаполнение услуг на основе абонентских договоров
Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт  

	// 1. Получение настроек из констант
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

	Если Не ЗначениеЗаполнено(АбонентскаяПлата) Или Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены константы номенклатуры в настройках!");
		Возврат;
	КонецЕсли;

	Услуги.Очистить();       
	
	// 2. Блок Абонентской платы с проверкой на дубли в текущем месяце
	АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СуммаАбонентскойПлаты");
	Если АбонентскаяПлатаИзДоговора > 0 Тогда
		
		// Ищем, не выставляли ли мы уже абонплату по этому договору в этом месяце
		ЗапросДублиАбонплата = Новый Запрос;
		ЗапросДублиАбонплата.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1

			|	РеализацияУслуги.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияУслуги

			|ГДЕ
			|	РеализацияУслуги.Ссылка.Договор = &Договор
			|	И РеализацияУслуги.Ссылка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца

			|	И РеализацияУслуги.Номенклатура = &НоменклатураАбонплата
			|	И РеализацияУслуги.Ссылка.Проведен
			|	И РеализацияУслуги.Ссылка <> &ТекущийДокумент";

		ЗапросДублиАбонплата.УстановитьПараметр("Договор", Договор);
		ЗапросДублиАбонплата.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		ЗапросДублиАбонплата.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		ЗапросДублиАбонплата.УстановитьПараметр("НоменклатураАбонплата", АбонентскаяПлата);
		ЗапросДублиАбонплата.УстановитьПараметр("ТекущийДокумент", Ссылка);

		Если ЗапросДублиАбонплата.Выполнить().Пустой() Тогда
			// Актов с абонплатой еще нет — добавляем строку
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
			НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора;
		КонецЕсли;
	КонецЕсли;

	// 3. Блок Работ специалистов: Заполнение только НЕОПЛАЧЕННЫХ остатков из регистра
	ЗапросОстаткиРабот = Новый запрос;
	ЗапросОстаткиРабот.Текст = 
		"ВЫБРАТЬ

		|	СУММА(ЕСТЬNULL(Остатки.СуммаКОплатеОстаток, 0)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(Остатки.КоличествоЧасовОстаток, 0)) КАК КоличествоЧасов
		|ИЗ

		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&ГраницаОстатков, 
		|       Клиент = &Клиент И Договор = &Договор) КАК Остатки";

	// Используем Границу "Исключая", чтобы при перепроведении документа он не видел свои же движения расхода
	ЗапросОстаткиРабот.УстановитьПараметр("ГраницаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	ЗапросОстаткиРабот.УстановитьПараметр("Клиент", Контрагент);
	ЗапросОстаткиРабот.УстановитьПараметр("Договор", Договор);

	ВыборкаРабот = ЗапросОстаткиРабот.Выполнить().Выбрать();

	Если ВыборкаРабот.Следующий() И ЗначениеЗаполнено(ВыборкаРабот.Сумма) И ВыборкаРабот.Сумма > 0 Тогда
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура = РаботыСпециалиста;
		НоваяСтрока.Количество = ВыборкаРабот.КоличествоЧасов;
		
		Если ВыборкаРабот.КоличествоЧасов <> 0 Тогда
			НоваяСтрока.Цена = ВыборкаРабот.Сумма / ВыборкаРабот.КоличествоЧасов;
		Иначе
			НоваяСтрока.Цена = ВыборкаРабот.Сумма;
		КонецЕсли;
		
		НоваяСтрока.Сумма = ВыборкаРабот.Сумма;
	КонецЕсли;

	// Финальное обновление итога шапки
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");

КонецПроцедуры 
//--ВКМ

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	//++ВКМ 01.03.2026 Салтанова 
	//исправлена ошибка в коде - в цикле было ТоварыОснования
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока УслугиОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
